### The Melt method
* The melt method is the inverse of **pivot** method.
* It takes a 'wide' dataset and converts it to a 'tall' dataset.
* The **melt** method is ideal when you have multiple columns storing the same data point.
* Ask yourself whether the columns's values are a type of the column header. If they're not, the data is likely stored in a wide format.
* The **id_vars** parameter accepts the column whose values will be repeated for every column.
* The **var_name** parameter sets the name of the new column for the varying values (the former column names).
* The **value_name** parameter set the new name of the values column (holding the values from the original **DataFrame**).

In [1]:
import pandas as pd

In [4]:
dataframe = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 90, 78],
    'Science': [88, 92, 80],
    'English': [82, 85, 88]
})

In [6]:
dataframe

      Name  Math  Science  English
0    Alice    85       88       82
1      Bob    90       92       85
2  Charlie    78       80       88

In [7]:
dataframe.melt(id_vars=['Name'], var_name='Subject', value_name='Score')

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     78
3    Alice  Science     88
4      Bob  Science     92
5  Charlie  Science     80
6    Alice  English     82
7      Bob  English     85
8  Charlie  English     88